{
  "hoang": {
    "cats": "Cats are animals",
    "dogs": "Dogs are animals",
    "birds": "Birds are animals",
    "fish": "Fish are animals",
    "reptiles": "Reptiles are animals",
    "amphibians": "Amphibians are animals",
    "mammals": "Mammals are animals",
    "insects": "Insects are animals",
    "spiders": "Spiders are animals",
    "crustaceans": "Crustaceans are animals",
    "mollusks": "Mollusks are animals",
    "worms": "Worms are animals",
    "plants": "Plants are not animals",
    "fungi": "Fungi are not animals",
    "protozoa": "Protozoa are not animals",
    "viruses": "Viruses are not animals",
    "bacteria": "Bacteria are not animals",
    "archaea": "Archaea are not animals",
    "eukaryotes": "Eukaryotes are not animals",
    "cells": "Cells are not animals",
    "organisms": "Organisms are not animals",
    "species": "Species are not animals",
    "genomes": "Genomes are not animals",
    "genes": "Genes are not animals",
    "proteins": "Proteins are not animals",
    "enzymes": "Enzymes are not animals",
    "hormones": "Hormones are not animals",
    "DNA": "DNA is a molecule",
    "RNA": "RNA is a molecule",
    "chromosomes": "Chromosomes are structures",
    "mitochondria": "Mitochondria are structures",
    "nucleus": "Nucleus is a structure",
    "cytoplasm": "Cytoplasm is a structure",
    "cell membrane": "Cell membrane is a structure",
    "cell wall": "Cell wall is a structure",
    "cell organelles": "Cell organelles are structures",
    "the sun": "The sun is a star at the center of our solar system.",
    "the moon": "The moon is Earth's only natural satellite.",
    "water": "Water is essential for all known forms of life.",
    "gravity": "Gravity is a force that attracts two bodies towards each other.",
    "photosynthesis": "Photosynthesis is the process by which green plants use sunlight to synthesize foods.",
    "evolution": "Evolution is the change in the heritable characteristics of biological populations over successive generations.",
    "climate change": "Climate change refers to significant changes in global temperatures and weather patterns over time.",
    "internet": "The internet is a global network of interconnected computers that communicate through standardized protocols.",
    "artificial intelligence": "Artificial intelligence is the simulation of human intelligence processes by machines, especially computer systems.",
    "economy": "The economy is the system of production, distribution, and consumption of goods and services",
    "business": "Business is the activity of making, buying, or selling goods or services",
    "trade": "Trade is the exchange of goods or services between businesses or countries",
    "commerce": "Commerce is the exchange of goods, services, or something of value between businesses, organizations, or individuals",
    "industry": "Industry is a group of companies or organizations that are involved in a particular field of economic activity",
    "technology": "Technology is the application of scientific knowledge for practical purposes",
    "innovation": "Innovation is the process of creating new or improved products, processes, or services",
    "entrepreneurship": "Entrepreneurship is the process of designing, launching, and running a new business or venture",
    "leadership": "Leadership is the process of inspiring and influencing others to achieve a common goal",
    "management": "Management is the process of planning, organizing, leading, and controlling resources",
    "marketing": "Marketing is the process of promoting and selling products or services",
    "finance": "Finance is the management of money and investments",
    "accounting": "Accounting is the process of recording, classifying, and reporting financial transactions",
    "human resources": "Human resources is the department responsible for managing an organization's workforce",
    "communication": "Communication is the process of exchanging information and ideas",
    "teamwork": "Teamwork is the collaborative effort of individuals working towards a common goal",
    "time management": "Time management is the process of planning and controlling how much time is spent on activities",
    "productivity": "Productivity is the efficiency of achieving maximum output with minimum input",
    "goal setting": "Goal setting is the process of defining and working towards specific objectives",
    "motivation": "Motivation is the driving force that initiates and sustains goal-oriented behavior",
    "self-improvement": "Self-improvement is the process of making oneself better in various aspects of life",
    "personal growth": "Personal growth is the process of developing one's abilities and character",
    "well-being": "Well-being is a state of being happy, healthy, and prosperous" 
  }
}